In [23]:
import pandas as pd
import numpy as np

In [96]:
#way1: without downloading the data
# Install dependencies as needed:
# pip install kagglehub[pandas-datasets]
import kagglehub
from kagglehub import KaggleDatasetAdapter

# Set the path to the file you'd like to load
file_path = "data_science_student_marks.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "ayeshaimran123/data-science-student-marks",
  file_path,
)

print(df)

C:\Users\USER PC\AppData\Local\Temp\ipykernel_21288\3402128262.py:11: DeprecationWarning: Use dataset_load() instead of load_dataset(). load_dataset() will be removed in a future version.
  df = kagglehub.load_dataset(

     student_id     location  age  sql_marks  excel_marks  python_marks  \
0             4       Sydney   24         95           99            87
1             5        Tokyo   24         99           95            89
2             6       Berlin   22         72           70            99
3             7       London   23         97           90            74
4             8        Tokyo   22         91           71            79
..          ...          ...  ...        ...          ...           ...
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
0                82             75
1                86             82
2                79             77
3                72             85
4                80             75
..              ...            ...
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

[497 rows x 8 columns]

In [97]:
#way2:downloading the data
df = pd.read_csv("data_science_student_marks.csv")
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [108]:
# way 3
import kagglehub
import os 
import pandas as pd
# Download latest version
path = kagglehub.dataset_download("ayeshaimran123/data-science-student-marks")

file_path = os.path.join(path, 'data_science_student_marks.csv')
df = pd.read_csv(file_path)

df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [109]:
print(df.head(3)) #first 3 rows with dataframe
print(df.head()) #first 5 rows
print(df.tail()) #last 5 rows
print(df.tail(1)) #last rows

   student_id location  age  sql_marks  excel_marks  python_marks  \
0           4   Sydney   24         95           99            87
1           5    Tokyo   24         99           95            89
2           6   Berlin   22         72           70            99

   power_bi_marks  english_marks
0              82             75
1              86             82
2              79             77
   student_id location  age  sql_marks  excel_marks  python_marks  \
0           4   Sydney   24         95           99            87
1           5    Tokyo   24         99           95            89
2           6   Berlin   22         72           70            99
3           7   London   23         97           90            74
4           8    Tokyo   22         91           71            79

   power_bi_marks  english_marks
0              82             75
1              86             82
2              79             77
3              72             85
4              80             75
     student_id     location  age  sql_marks  excel_marks  python_marks  \
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86
     student_id location  age  sql_marks  excel_marks  python_marks  \
496         500   London   22         85           87            93

     power_bi_marks  english_marks
496              70             86

In [110]:
#information about df (data set I have)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497 entries, 0 to 496
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   student_id      497 non-null    int64
 1   location        497 non-null    object
 2   age             497 non-null    int64
 3   sql_marks       497 non-null    int64
 4   excel_marks     497 non-null    int64
 5   python_marks    497 non-null    int64
 6   power_bi_marks  497 non-null    int64
 7   english_marks   497 non-null    int64
dtypes: int64(7), object(1)
memory usage: 31.2+ KB

In [111]:
#check the statics
df.describe()

,student_id,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
count,497.000000,497.000000,497.000000,497.000000,497.000000,497.000000,497.000000
mean,252.000000,21.380282,84.661972,85.384306,85.388330,84.545272,84.824950
std,143.615807,2.205714,8.745415,8.782497,8.878668,8.903066,9.060479
min,4.000000,18.000000,70.000000,70.000000,70.000000,70.000000,70.000000
25%,128.000000,20.000000,78.000000,78.000000,77.000000,77.000000,77.000000
50%,252.000000,21.000000,85.000000,86.000000,86.000000,84.000000,85.000000
75%,376.000000,23.000000,92.000000,93.000000,94.000000,92.000000,93.000000
max,500.000000,25.000000,100.000000,100.000000,100.000000,100.000000,100.000000

In [112]:
#only columns
df.columns

Index(['student_id', 'location', 'age', 'sql_marks', 'excel_marks',
       'python_marks', 'power_bi_marks', 'english_marks'],
      dtype='object')

In [113]:
#only columns with loop
for i in df:
    print(i) #output array type

student_id
location
age
sql_marks
excel_marks
python_marks
power_bi_marks
english_marks

In [114]:
df["student_id"]

0        4
1        5
2        6
3        7
4        8
      ...
492    496
493    497
494    498
495    499
496    500
Name: student_id, Length: 497, dtype: int64

In [115]:
df[["age","power_bi_marks"]] #two [[]] , output in dataframe

     age  power_bi_marks
0     24              82
1     24              86
2     22              79
3     23              72
4     22              80
..   ...             ...
492   23              78
493   20              78
494   22              71
495   21              78
496   22              70

[497 rows x 2 columns]

In [116]:
df[["age","python_marks","english_marks"]]

     age  python_marks  english_marks
0     24            87             75
1     24            89             82
2     22            99             77
3     23            74             85
4     22            79             75
..   ...           ...            ...
492   23            98             88
493   20            90             73
494   22            78             70
495   21            78             82
496   22            93             86

[497 rows x 3 columns]

In [117]:
print(df["python_marks"].mean()) #of any column
print(df["python_marks"].max())
print(df["python_marks"].min())

85.38832997987927
100
70

In [118]:
print(df[["python_marks","age"]].min())

python_marks    70
age             18
dtype: int64

In [119]:
#print(df["location"].mean()) #Error

In [120]:
df.iloc[0] #rows in position, the first student

student_id             4
location          Sydney
age                   24
sql_marks             95
excel_marks           99
python_marks          87
power_bi_marks        82
english_marks         75
Name: 0, dtype: object

In [121]:
df.iloc[10:15] #the student from 10 to 15 by slising

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
10,14,Toronto,20,81,74,88,99,96
11,15,Paris,24,94,93,87,80,71
12,16,Tokyo,19,73,82,78,70,84
13,17,Tokyo,25,82,75,77,78,85
14,18,Melbourne,19,89,76,96,93,71

In [122]:
df.iloc[10:15,6:] #use position to get rows and coulmns

    power_bi_marks  english_marks
10              99             96
11              80             71
12              70             84
13              78             85
14              93             71

In [123]:
df.iloc[10,6]

np.int64(99)

In [124]:
#first student marks in mysql 
df.iloc[0,3]

np.int64(95)

In [125]:
#all students marks in excel_marks and english_marks	
df.iloc[:,[4,7]]

     excel_marks  english_marks
0             99             75
1             95             82
2             70             77
3             90             85
4             71             75
..           ...            ...
492           92             88
493          100             73
494           80             70
495           93             82
496           87             86

[497 rows x 2 columns]

In [126]:
df.iloc[:,::2] #jump 2 times in columns

     student_id  age  excel_marks  power_bi_marks
0             4   24           99              82
1             5   24           95              86
2             6   22           70              79
3             7   23           90              72
4             8   22           71              80
..          ...  ...          ...             ...
492         496   23           92              78
493         497   20          100              78
494         498   22           80              71
495         499   21           93              78
496         500   22           87              70

[497 rows x 4 columns]

In [127]:
df.iloc[::4,::2] #jump 2 times in columns and 4 times in rows

     student_id  age  excel_marks  power_bi_marks
0             4   24           99              82
4             8   22           71              80
8            12   24           95              90
12           16   19           82              70
16           20   25           87              79
..          ...  ...          ...             ...
480         484   18           78              73
484         488   21           94              77
488         492   23           73              81
492         496   23           92              78
496         500   22           87              70

[125 rows x 4 columns]

In [129]:
#1
print(df.head(10))

   student_id   location  age  sql_marks  excel_marks  python_marks  \
0           4     Sydney   24         95           99            87
1           5      Tokyo   24         99           95            89
2           6     Berlin   22         72           70            99
3           7     London   23         97           90            74
4           8      Tokyo   22         91           71            79
5           9    Toronto   20         93           88            75
6          10      Tokyo   18         77           87           100
7          11    Toronto   21         78           90            88
8          12  Melbourne   24         80           95            87
9          13     London   19         97           80            96

   power_bi_marks  english_marks
0              82             75
1              86             82
2              79             77
3              72             85
4              80             75
5              93             72
6              98             93
7              79             72
8              90             94
9              97             86

In [130]:
#2
print(df.tail(5))

     student_id     location  age  sql_marks  excel_marks  python_marks  \
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

In [141]:
#display columns name,shape,and info
print(df.columns,df.shape,df.info)

Index(['student_id', 'location', 'age', 'sql_marks', 'excel_marks',
       'python_marks', 'power_bi_marks', 'english_marks'],
      dtype='object') (497, 8) <bound method DataFrame.info of      student_id     location  age  sql_marks  excel_marks  python_marks  \
0             4       Sydney   24         95           99            87
1             5        Tokyo   24         99           95            89
2             6       Berlin   22         72           70            99
3             7       London   23         97           90            74
4             8        Tokyo   22         91           71            79
..          ...          ...  ...        ...          ...           ...
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
0                82             75
1                86             82
2                79             77
3                72             85
4                80             75
..              ...            ...
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

[497 rows x 8 columns]>

In [140]:
#display only location and python_marks columns
df.iloc[:,[1,5]]

        location  python_marks
0         Sydney            87
1          Tokyo            89
2         Berlin            99
3         London            74
4          Tokyo            79
..           ...           ...
492     New York            98
493  Los Angeles            90
494        Paris            78
495  Los Angeles            78
496       London            93

[497 rows x 2 columns]

In [139]:
#display first 5 rows of sql_marks and excel_marks
df.iloc[:5,[3,4]]

   sql_marks  excel_marks
0         95           99
1         99           95
2         72           70
3         97           90
4         91           71

In [146]:
#select row for student id 10
df.iloc[6]

student_id           10
location          Tokyo
age                  18
sql_marks            77
excel_marks          87
python_marks        100
power_bi_marks       98
english_marks        93
Name: 6, dtype: object

In [149]:
df.loc[10]

student_id             14
location          Toronto
age                    20
sql_marks              81
excel_marks            74
python_marks           88
power_bi_marks         99
english_marks          96
Name: 10, dtype: object

In [192]:
(df["sql_marks"] > 95).sum()

np.int64(64)

In [153]:
df[df["sql_marks"] == 100]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
34,38,Berlin,21,100,95,78,73,77
48,52,Sydney,20,100,88,75,70,83
80,84,London,23,100,80,74,70,85
87,91,London,21,100,95,81,86,70
129,133,Melbourne,21,100,90,80,73,74
185,189,Toronto,19,100,94,88,74,88
197,201,Melbourne,25,100,91,75,99,98
261,265,London,18,100,82,73,77,91
302,306,London,22,100,94,89,93,70
306,310,Los Angeles,22,100,81,74,88,70
311,315,London,23,100,77,100,81,70
358,362,Los Angeles,22,100,79,91,88,100
372,376,Sydney,23,100,93,76,85,94

In [157]:
df[df["age"] > 22]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
3,7,London,23,97,90,74,72,85
8,12,Melbourne,24,80,95,87,90,94
11,15,Paris,24,94,93,87,80,71
...,...,...,...,...,...,...,...,...
488,492,London,23,85,73,78,81,96
489,493,Los Angeles,24,94,74,80,92,95
490,494,Melbourne,25,84,96,72,93,86
491,495,New York,24,83,78,82,84,84
492,496,New York,23,71,92,98,78,88

In [158]:
(df["sql_marks"] > 22).sum()

np.int64(497)

In [170]:
((df["age"] >= 22) & (df["age"] <= 25)).sum()

np.int64(229)

In [172]:
df[(df["age"] >= 22) & (df["age"] <= 25)]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
490,494,Melbourne,25,84,96,72,93,86
491,495,New York,24,83,78,82,84,84
492,496,New York,23,71,92,98,78,88
494,498,Paris,22,78,80,78,71,70
496,500,London,22,85,87,93,70,86

In [175]:
#add new column
df["age2"] = df["age"] + 1

In [174]:
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,age2
0,4,Sydney,24,95,99,87,82,75,25
1,5,Tokyo,24,99,95,89,86,82,25
2,6,Berlin,22,72,70,99,79,77,23
3,7,London,23,97,90,74,72,85,24
4,8,Tokyo,22,91,71,79,80,75,23
...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,24
493,497,Los Angeles,20,90,100,90,78,73,21
494,498,Paris,22,78,80,78,71,70,23
495,499,Los Angeles,21,96,93,78,78,82,22
496,500,London,22,85,87,93,70,86,23

In [184]:
df["total"] = df["sql_marks"] + df["excel_marks"] + df["python_marks"] +df["power_bi_marks"] +df["english_marks"]

In [185]:
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,age2,total
0,4,Sydney,24,95,99,87,82,75,25,438
1,5,Tokyo,24,99,95,89,86,82,25,451
2,6,Berlin,22,72,70,99,79,77,23,397
3,7,London,23,97,90,74,72,85,24,418
4,8,Tokyo,22,91,71,79,80,75,23,396
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,24,427
493,497,Los Angeles,20,90,100,90,78,73,21,431
494,498,Paris,22,78,80,78,71,70,23,377
495,499,Los Angeles,21,96,93,78,78,82,22,427
496,500,London,22,85,87,93,70,86,23,421

In [190]:
df["total"] = df[["sql_marks", "excel_marks", "python_marks","power_bi_marks", "english_marks"]].sum(axis=1)

In [191]:
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,age2,total
0,4,Sydney,24,95,99,87,82,75,25,438
1,5,Tokyo,24,99,95,89,86,82,25,451
2,6,Berlin,22,72,70,99,79,77,23,397
3,7,London,23,97,90,74,72,85,24,418
4,8,Tokyo,22,91,71,79,80,75,23,396
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,24,427
493,497,Los Angeles,20,90,100,90,78,73,21,431
494,498,Paris,22,78,80,78,71,70,23,377
495,499,Los Angeles,21,96,93,78,78,82,22,427
496,500,London,22,85,87,93,70,86,23,421